gsmanees/Embedded_Systems/STM32/amv/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "stm32f446xx.h"
#include "stm32f446xx_gpio_driver.h"

#define LED1 GPIO_PIN_NO_6
#define LED2 GPIO_PIN_NO_7

void delay(void)
{
	for(int i=0; i<500000; i++);
}


int main(void)
{
	// declare handles
	GPIO_Handle_t led1_handle;
	GPIO_Handle_t led2_handle;

	// configure LED1
	led1_handle.pGPIOx = GPIOA;
	led1_handle.GPIO_PinConfig.GPIO_PinNumber = LED1;
	led1_handle.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	led1_handle.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	led1_handle.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	led1_handle.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;


	// configure LED2
	led2_handle.pGPIOx = GPIOA;
	led2_handle.GPIO_PinConfig.GPIO_PinNumber = LED2;
	led2_handle.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	led2_handle.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	led2_handle.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	led2_handle.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	// clock enable
	GPIO_PeriClockControl(GPIOA, ENABLE);

	// initialise handles
	GPIO_Init(&led1_handle);
	GPIO_Init(&led2_handle);




	while(1)
	{
		GPIO_WriteToOutputPin(GPIOA, LED1, 1);
		GPIO_WriteToOutputPin(GPIOA, LED2, 0);
		delay();
		GPIO_WriteToOutputPin(GPIOA, LED1, 0);
		GPIO_WriteToOutputPin(GPIOA, LED2, 1);
		delay();

	}


}
